zglue/zglue_nuttx/arch/arm/src/nrf52/hal/nrf_qspi.h
__STATIC_INLINE void nrf_qspi_task_trigger(NRF_QSPI_Type *p_reg, nrf_qspi_task_t task)
{
  *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)task)) = 0x1UL;
}

__STATIC_INLINE uint32_t nrf_qspi_task_address_get(NRF_QSPI_Type const *p_reg,
                                                   nrf_qspi_task_t       task)
{
  return ((uint32_t)p_reg + (uint32_t)task);
}

__STATIC_INLINE void nrf_qspi_event_clear(NRF_QSPI_Type *p_reg, nrf_qspi_event_t qspi_event)
{
  *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)qspi_event)) = 0x0UL;
}

__STATIC_INLINE bool nrf_qspi_event_check(NRF_QSPI_Type const *p_reg, nrf_qspi_event_t qspi_event)
{
  return (bool) * (volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)qspi_event);
}

__STATIC_INLINE uint32_t *nrf_qspi_event_address_get(NRF_QSPI_Type const *p_reg,
                                                     nrf_qspi_event_t      qspi_event)
{
  return (uint32_t *)((uint8_t *)p_reg + (uint32_t)qspi_event);
}

__STATIC_INLINE void nrf_qspi_int_enable(NRF_QSPI_Type *p_reg, uint32_t qspi_int_mask)
{
  p_reg->INTENSET = qspi_int_mask;
}

__STATIC_INLINE void nrf_qspi_int_disable(NRF_QSPI_Type *p_reg, uint32_t qspi_int_mask)
{
  p_reg->INTENCLR = qspi_int_mask;
}

__STATIC_INLINE bool nrf_qspi_int_enable_check(NRF_QSPI_Type const *p_reg,
                                               nrf_qspi_int_mask_t   qspi_int)
{
  return (bool)(p_reg->INTENSET & qspi_int);
}

__STATIC_INLINE void nrf_qspi_enable(NRF_QSPI_Type *p_reg)
{
  p_reg->ENABLE = (QSPI_ENABLE_ENABLE_Enabled << QSPI_ENABLE_ENABLE_Pos);
}

__STATIC_INLINE void nrf_qspi_disable(NRF_QSPI_Type *p_reg)
{
  p_reg->ENABLE = (QSPI_ENABLE_ENABLE_Disabled << QSPI_ENABLE_ENABLE_Pos);
}

__STATIC_INLINE void nrf_qspi_pins_set(NRF_QSPI_Type *p_reg, const nrf_qspi_pins_t *p_pins)
{
  p_reg->PSEL.SCK = NRF_QSPI_PIN_VAL(p_pins->sck_pin);
  p_reg->PSEL.CSN = NRF_QSPI_PIN_VAL(p_pins->csn_pin);
  p_reg->PSEL.IO0 = NRF_QSPI_PIN_VAL(p_pins->io0_pin);
  p_reg->PSEL.IO1 = NRF_QSPI_PIN_VAL(p_pins->io1_pin);
  p_reg->PSEL.IO2 = NRF_QSPI_PIN_VAL(p_pins->io2_pin);
  p_reg->PSEL.IO3 = NRF_QSPI_PIN_VAL(p_pins->io3_pin);
}

__STATIC_INLINE void nrf_qspi_xip_offset_set(NRF_QSPI_Type *p_reg,
                                             uint32_t        xip_offset)
{
  p_reg->XIPOFFSET = xip_offset;
}

__STATIC_INLINE void nrf_qspi_ifconfig0_set(NRF_QSPI_Type               *p_reg,
                                            const nrf_qspi_prot_conf_t *p_config)
{
  uint32_t config = p_config->readoc;
  config |= ((uint32_t)p_config->writeoc)    << QSPI_IFCONFIG0_WRITEOC_Pos;
  config |= ((uint32_t)p_config->addrmode)   << QSPI_IFCONFIG0_ADDRMODE_Pos;
  config |= (p_config->dpmconfig ? 1U : 0U ) << QSPI_IFCONFIG0_DPMENABLE_Pos;

  p_reg->IFCONFIG0 = config;
}

__STATIC_INLINE void nrf_qspi_ifconfig1_set(NRF_QSPI_Type              *p_reg,
                                            const nrf_qspi_phy_conf_t *p_config)
{
  // IFCONFIG1 mask for reserved fields in the register.
  uint32_t config = p_reg->IFCONFIG1 & 0x00FFFF00;
  config |= p_config->sck_delay;
  config |= (p_config->dpmen ? 1U : 0U)      << QSPI_IFCONFIG1_DPMEN_Pos;
  config |= ((uint32_t)(p_config->spi_mode)) << QSPI_IFCONFIG1_SPIMODE_Pos;
  config |= ((uint32_t)(p_config->sck_freq)) << QSPI_IFCONFIG1_SCKFREQ_Pos;

  p_reg->IFCONFIG1 = config;
}

__STATIC_INLINE void nrf_qspi_addrconfig_set(NRF_QSPI_Type                     *p_reg,
                                             const nrf_qspi_addrconfig_conf_t *p_config)
{
  uint32_t config = p_config->opcode;
  config |= ((uint32_t)p_config->byte0)   << QSPI_ADDRCONF_BYTE0_Pos;
  config |= ((uint32_t)p_config->byte1)   << QSPI_ADDRCONF_BYTE1_Pos;
  config |= ((uint32_t)(p_config->mode))  << QSPI_ADDRCONF_MODE_Pos;
  config |= (p_config->wipwait ? 1U : 0U) << QSPI_ADDRCONF_WIPWAIT_Pos;
  config |= (p_config->wren    ? 1U : 0U) << QSPI_ADDRCONF_WREN_Pos;

  p_reg->ADDRCONF = config;
}

__STATIC_INLINE void nrf_qspi_write_buffer_set(NRF_QSPI_Type *p_reg,
                                               void const     *p_buffer,
                                               uint32_t        length,
                                               uint32_t        dest_addr)
{
  p_reg->WRITE.DST = dest_addr;
  p_reg->WRITE.SRC = (uint32_t) p_buffer;
  p_reg->WRITE.CNT = length;
}

__STATIC_INLINE void nrf_qspi_read_buffer_set(NRF_QSPI_Type *p_reg,
                                              void           *p_buffer,
                                              uint32_t        length,
                                              uint32_t        src_addr)
{
  p_reg->READ.SRC = src_addr;
  p_reg->READ.DST = (uint32_t) p_buffer;
  p_reg->READ.CNT = length;
}

__STATIC_INLINE void nrf_qspi_erase_ptr_set(NRF_QSPI_Type       *p_reg,
                                            uint32_t             erase_addr,
                                            nrf_qspi_erase_len_t len)
{
  p_reg->ERASE.PTR = erase_addr;
  p_reg->ERASE.LEN = len;
}

__STATIC_INLINE uint32_t nrf_qspi_status_reg_get(NRF_QSPI_Type const *p_reg)
{
  return p_reg->STATUS;
}

__STATIC_INLINE uint8_t nrf_qspi_sreg_get(NRF_QSPI_Type const *p_reg)
{
  return (uint8_t)(p_reg->STATUS & QSPI_STATUS_SREG_Msk) >> QSPI_STATUS_SREG_Pos;
}

__STATIC_INLINE bool nrf_qspi_busy_check(NRF_QSPI_Type const *p_reg)
{
  return ((p_reg->STATUS & QSPI_STATUS_READY_Msk) >>
          QSPI_STATUS_READY_Pos) == QSPI_STATUS_READY_BUSY;
}

__STATIC_INLINE void nrf_qspi_cinstrdata_set(NRF_QSPI_Type        *p_reg,
                                             nrf_qspi_cinstr_len_t length,
                                             void const           *p_tx_data)
{
  uint32_t reg = 0;
  uint8_t const *p_tx_data_8 = (uint8_t const *) p_tx_data;

  // Load custom instruction.
  switch (length)
    {
      case NRF_QSPI_CINSTR_LEN_9B:
        reg |= ((uint32_t)p_tx_data_8[7]) << QSPI_CINSTRDAT1_BYTE7_Pos;
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_8B:
        reg |= ((uint32_t)p_tx_data_8[6]) << QSPI_CINSTRDAT1_BYTE6_Pos;
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_7B:
        reg |= ((uint32_t)p_tx_data_8[5]) << QSPI_CINSTRDAT1_BYTE5_Pos;
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_6B:
        reg |= ((uint32_t)p_tx_data_8[4]);
        p_reg->CINSTRDAT1 = reg;
        reg = 0;
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_5B:
        reg |= ((uint32_t)p_tx_data_8[3]) << QSPI_CINSTRDAT0_BYTE3_Pos;
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_4B:
        reg |= ((uint32_t)p_tx_data_8[2]) << QSPI_CINSTRDAT0_BYTE2_Pos;
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_3B:
        reg |= ((uint32_t)p_tx_data_8[1]) << QSPI_CINSTRDAT0_BYTE1_Pos;
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_2B:
        reg |= ((uint32_t)p_tx_data_8[0]);
        p_reg->CINSTRDAT0 = reg;
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_1B:
        /* Send only opcode. Case to avoid compiler warnings. */
        break;
      default:
        break;
    }
}

__STATIC_INLINE void nrf_qspi_cinstrdata_get(NRF_QSPI_Type const *p_reg,
                                             nrf_qspi_cinstr_len_t length,
                                             void                 *p_rx_data)
{
  uint8_t *p_rx_data_8 = (uint8_t *) p_rx_data;

  uint32_t reg = p_reg->CINSTRDAT1;
  switch (length)
    {
      case NRF_QSPI_CINSTR_LEN_9B:
        p_rx_data_8[7] = (uint8_t)(reg >> QSPI_CINSTRDAT1_BYTE7_Pos);
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_8B:
        p_rx_data_8[6] = (uint8_t)(reg >> QSPI_CINSTRDAT1_BYTE6_Pos);
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_7B:
        p_rx_data_8[5] = (uint8_t)(reg >> QSPI_CINSTRDAT1_BYTE5_Pos);
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_6B:
        p_rx_data_8[4] = (uint8_t)(reg);
      /* fall-through */
      default:
        break;
    }

  reg = p_reg->CINSTRDAT0;
  switch (length)
    {
      case NRF_QSPI_CINSTR_LEN_5B:
        p_rx_data_8[3] = (uint8_t)(reg >> QSPI_CINSTRDAT0_BYTE3_Pos);
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_4B:
        p_rx_data_8[2] = (uint8_t)(reg >> QSPI_CINSTRDAT0_BYTE2_Pos);
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_3B:
        p_rx_data_8[1] = (uint8_t)(reg >> QSPI_CINSTRDAT0_BYTE1_Pos);
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_2B:
        p_rx_data_8[0] = (uint8_t)(reg);
      /* fall-through */
      case NRF_QSPI_CINSTR_LEN_1B:
        /* Send only opcode. Case to avoid compiler warnings. */
        break;
      default:
        break;
    }
}

__STATIC_INLINE void nrf_qspi_cinstr_transfer_start(NRF_QSPI_Type                 *p_reg,
                                                    const nrf_qspi_cinstr_conf_t *p_config)
{
  p_reg->CINSTRCONF = (((uint32_t)p_config->opcode    << QSPI_CINSTRCONF_OPCODE_Pos) |
                       ((uint32_t)p_config->length    << QSPI_CINSTRCONF_LENGTH_Pos) |
                       ((uint32_t)p_config->io2_level << QSPI_CINSTRCONF_LIO2_Pos) |
                       ((uint32_t)p_config->io3_level << QSPI_CINSTRCONF_LIO3_Pos) |
                       ((uint32_t)p_config->wipwait   << QSPI_CINSTRCONF_WIPWAIT_Pos) |
                       ((uint32_t)p_config->wren      << QSPI_CINSTRCONF_WREN_Pos));
}

#endif // SUPPRESS_INLINE_IMPLEMENTATION

/** @} */

#ifdef __cplusplus
}
#endif

#endif // NRF_QSPI_H__
